# AnalysisDisplayColoredSurfaceSettings Constructor (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings Constructor
AnalysisDisplayColoredSurfaceSettings Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AnalysisDisplayColoredSurfaceSettings()()()() | Constructs a default instance of colored surface settings. |
| AnalysisDisplayColoredSurfaceSettings(AnalysisDisplayColoredSurfaceSettings) | Constructs a new copy of the input AnalysisDisplayColoredSurfaceSettings object. |

# See Also
AnalysisDisplayColoredSurfaceSettings Class
AnalysisDisplayColoredSurfaceSettings Members
Autodesk.Revit.DB.Analysis Namespace